<!doctype html public "-//IETF//DTD HTML//EN">

<HTML>
<HEAD>
<TITLE>Geb&uuml;hrenerfassung und -auswerung f&uuml;r Euracom PABX</TITLE>
</HEAD>
<BODY>

<H1>Geb&uuml;hrenerfassung f&uuml;r Euracom 18x mittels SQL Datenbank</H1>

<H2>Einf&uuml;hrung</H2>
<P>
Das Programm liest die von der Tk-Anlage &uuml;ber die V24-Schnittstelle
ausgegebenen Geb&uuml;hrendaten und schreibt die aufgearbeiteten Daten in eine
SQL-Datenbank.  Ebenso wird f&uuml;r jeden Datensatz auch
eine Meldung via syslog() ausgegeben. Die Verbindung zur Datenbank, die sich auch
auf einem anderen Rechner im Netz befinden kann, wird automatisch bei Bedarf
aufgebaut und, falls eine gewisse Zeit keine Eintr&auml;ge mehr eingef&uuml;gt
wurden, auch wieder abgebaut.  Sollte die Datenbank genau zu dem Zeitpunkt wenn
Daten eingef&uuml;gt werden m&uuml;ssen, nicht erreichbar sein, schreibt das
Programm die Daten in eine Datei.  In regelm&auml;&szlig;igen Abst&auml;nden
wird versucht, die Verbindung zum DBMS herzustellen.  Sobald dies gelungen
ist, werden die fehlenden Datens&auml;tze in die Tabelle geschrieben.
</P>

<P>
Zur Zeit unterst&uuml;tzte DMBS sind: PostgreSQL, mSQL und MySQL
</P>

<H2>Systemvoraussetzungen</H2>
<H3>Hardware</H3>
<P>
Das Programm liest die Geb&uuml;hreninformationen, die am Druckerausgang einer
<A HREF="http://www.ackermann.de/">Ackermann</A> Euracom 18{0,1,2} Tk-Anlange
ausgegeben werden.  Nachbauten der Anlage (z.B. QUANTE IS-{0,1,2}) werden
ebenfalls unterst&uuml;tzt.  Es k&ouml;nnen alle Firmware-Releases bis einschlie&szlig;lich
3.02d eingesetzt werden.
</P>
<P>
Der Druckerport der Anlage (bei F/W &lt;= 1.11B ist das defaultm&auml;&szlig;ig der Port
V24-2) mu&szlig; mit einem freien RS232 Port des Rechners verbunden werden.
Benutzen Sie ein Verbindungskabel bei dem die Leitungen RX, TX, DTR, DSR, RTS,
CTS und GND <B>1:1</B> durchgeschaltet sind (<B>kein</B> Null-Modem Kabel!).
Wenn Sie auf der sicheren Seite seien m&ouml;chten, verwenden Sie ein 9-poliges 1:1
Kabel.  Falls Ihr Rechner noch einen 25 polige DSub Anschlu&szlig; hat, so ben&ouml;tigen
Sie ein anderes Verdrahtungsschema.  Ich verweise da auf das Kapitel
<I>PC/Drucker an den RS232-C Anschl&uuml;ssen installieren (4.8)</I> im Handbuch
der Euracom-Anlage.  F&uuml;r den Eingang auf Seiten des PC reicht ein Port mit
82450, 8250 oder 16450 UART vollkommen aus.  Auf der anderen Seite, wenn
nat&uuml;rlich ein 16550A oder eine intelligente serielle Interfacekarte vorhanden
ist -- umso besser.  (Beachten Sie dazu bitte den Punkt 
<A HREF="#bugs">Bugs</A>).
</P>

<H3>Software</H3>
<P>
Zus&auml;tzlich zu diesem Programm ben&ouml;tigen Sie noch folgende Software:
</P>
<UL>
  <LI>Geb&uuml;hrenerfassung/Auswertung mittels PostgreSQL:
    <UL>
    <LI> <A HREF="http://www.postgreSQL.org/">PostgreSQL</A> (6.1 oder h&ouml;her, es wird
       wohl auch mit &auml;lteren Versionen funktionieren)  Beachten Sie bitte
       ebenfalls den Punkt <A HREF="#bugs">Bugs</A>.
    <LI> <A HREF="http://www.perl.org/">Perl</A> (5.003 oder h&ouml;her)
    <LI> <A HREF="mailto:e.mergl@bawue.de">Edmund Mergl's</A> <EM>pgsql_perl5</EM> (1.6)
       -- ist in den aktuellen PostgreSQL Distributionen enthalten.
    </UL>
  <LI>Geb&uuml;hrenerfassung mittels miniSQL:
    <UL>
    <LI><A HREF="http://www.hughes.com.au/">miniSQL</A>
    </UL>
  <LI>Geb&uuml;hrenerfassung mittels MySQL:
    <UL>
    <LI> MySQL (URL??)
    </UL>
</UL>

<H2>Konfiguration und Installation</H2>
<H3>Kompilieren der Sourcen</H3>
<P>
Nach dem Entpacken der Sourcen starten Sie <CODE>./configure</CODE>.  Auf
jeden Fall mu&szlig; der Parameter <CODE>--with-area-code=x</CODE> angegeben
werden.  Ersetzen Sie x durch Ihre Vorwahl (ohne die 0).  F&uuml;r eine Liste
aller unterst&uuml;zten Parameter rufen Sie <CODE>./configure</CODE> mit
<CODE>--help</CODE> auf.
</P>
<P>
Werfen Sie danach einen Blick in das erzeugte <CODE>Makefile</CODE>.  Die
Umstellung auf <CODE>autoconf</CODE> ist noch nicht v&ouml;llig abgeschlossen,
so da&szlig; evtl. noch einige Anpassungen im <CODE>Makefile</CODE>
vorgenommen werden m&uuml;ssen (Pfade zum DBMS).
</P>
<P>
Danach sollte ein <CODE>make</CODE> alle ben&ouml;tigten Programme erzeugen.  Auf
einem Linux/GNU System wird die Kompilierung mit gro&szlig;er Wahrscheinlichkeit 
ohne Probleme ablaufen, bei anderen Unices kann es sein, da&szlig; einige
Include-Files nicht vorhanden sind, oder andere (kleinere)
Kompatibilit&auml;tsprobleme auftreten.  In so einem Fall bitte ich um eine
<A HREF="mailto:bus@fgan.de">Mail an mich</A>, so da&szlig; ich die M&ouml;glichkeit
habe, die Programme portabler zu gestalten.
</P>

<H3>Einrichten der Datenbank</H3>
<P>
Meldete <CODE>make</CODE> keine Probleme bei der Kompilation, so k&ouml;nnen wir
nun den n&auml;chsten Punkt angehen, der Erstellung der Datenbank, in der das
Programm die Geb&uuml;hreninformationen schreiben wird.
</P>

<H4>PostgreSQL version</H4>
<P>
Zuerst ist mittels <CODE>createdb isdn</CODE> eine neue Datenbank Namens
<I>isdn</I> anzulegen.  Theoretisch ist nat&uuml;rlich auch ein anderer Name
m&ouml;glich, aber besonders auf Linux-Systemen, die <I>isdn4linux</I> verwenden,
bietet sich <I>isdn</I> besonders an, da auch das Programm <I>isdnlog</I>
defaultm&auml;&szlig;ig diesen Namen als Datenbank verwendet (wenn man isdnlog mit
PostgreSQL-Unterst&uuml;tzung kompiliert hat).
</P>
<P>
Mit <CODE>make database</CODE> werden alle ben&ouml;tigten Tabellen erzeugt,
wobei f&uuml;r die reine Geb&uuml;hrenerfassung nur die Tabelle <EM>euracom</EM>
von Bedeutung ist.  Dem Benutzer, unter dessen Kennung "euracom" abl&auml;uft,
mu&szlig; (INSERT) Zugriff auf die Tabelle erlaubt werden (falls der Benutzer
nicht identisch mit dem DBA ist).  Evtl. mu&szlig; dieser Benutzer vorher mit
<CODE>createuser &lt;username&gt;</CODE> eingerichtet werden.
</P>

<PRE>
GRANT INSERT ON euracom TO Benutzer;
</PRE>

<H4>miniSQL version</H4>
<P>
???
</P>

<H3>Installation</H3>
<P>
F&uuml;r diesen Schritt werden Sie in den meisten F&auml;llen root-Rechte ben&ouml;tigen.
Ein <CODE>make install</CODE> nimmt Ihnen l&auml;stige Arbeit ab, indem es alle
ben&ouml;tigten Files an die richtige Stelle kopiert.  Defaultm&auml;&szlig;ig wird das
Hauptprogramm <CODE>euracom</CODE> nach <CODE>/usr/local/sbin</CODE>, die
Manual-Page nach <CODE>/usr/local/man/man8</CODE> und das shared object f&uuml;r
PostgreSQL nach <CODE>PGBASE/obj</CODE> kopiert.
</P>
<P>
Falls Sie <CODE>euracom</CODE> nicht als root starten wollen oder k&ouml;nnen (die
Option <CODE>--run-as-user</CODE> ist davon <B>nicht</B> betroffen), dann
m&uuml;ssen Sie darauf achten, da&szlig; sie Schreib- und Lesezugriff auf die
Verzeichnisse haben, die in <CODE>config.h</CODE> unter <CODE>PIDFILE</CODE>
und <CODE>LOCKPATH</CODE> aufgef&uuml;hrt sind.  Nat&uuml;rlich brauchen Sie ebenfalls
RW-permission auf das serielle Device.
</P>
<P>Wenn in der <CODE>config.h</CODE> das Makro <CODE>DEF_LOGFAC</CODE> nicht
ge&auml;ndert wurde, schreibt euracom syslog-Ausgaben in die syslog Facility
<EM>local0</EM>.  Es ist sinnvoll, in der <CODE>/etc/syslog.conf</CODE> einen
Eintrag zu machen, da&szlig; alle local0 Messages separat geloggt werden sollen, was
durch folgenden Eintrag bewerkstelligt wird:
</P>
<PRE>
local0.*	/var/log/telephone.log
</PRE>

<H4>Geb&uuml;hrenausdruck der Anlage vorbereiten</H4>
<P>
Verbinden Sie nun den Druckerausgang der Tk-Anlage mit einem freien V24-Port
Ihres Rechners und aktivieren Sie die Geb&uuml;hrendruckfunktion der Anlage.  Die
folgende Befehlsfolge, die sie an jedem Master-f&auml;higen Telefon der Anlage
eingeben k&ouml;nnen aktiviert die Geb&uuml;hrenauswertung f&uuml;r <I>jeden</I> internen
Anschlu&szlig; (mit Anzeige der <I>kompletten</I> Rufnummer), und erfa&szlig;t auch
kommende Verbindungen (mit und ohne Verbindung):
</P>

<UL>
<LI> <CODE># * 7 3 1 0 0 # </CODE>
<LI> <CODE># * 7 0 1 1 #</CODE>
<LI> <CODE># * 7 0 2 1 #</CODE>
<LI> <CODE># * 7 1 1 0 0 # </CODE>
</UL>

<P>
Das sollte es eigentlich gewesen sein!
</P>

<H2>Start des Daemons</H3>
<P>
Starten Sie das Programm mit <CODE>euracom [-options]
device</CODE>. <CODE>device</CODE> ist hier die verwendete serielle
Schnittstelle.  Das Programm versucht als erstes das Device zu locken, um
Kollisionen mit anderen Programmes auszuschlie&szlig;en.  Sollte ein anderer
Proze&szlig; diesen Port bereits benutzen (und kennzeichnet dies durch die
Verwendung eines Locks), so bricht <CODE>euracom</CODE> mit einer
Fehlermeldung ab.  Das gleiche gilt, wenn bereits ein <CODE>euracom</CODE>
Proze&szlig; aktiv ist.
</P>
<P>
Alle Fehler w&auml;hrend der Initialisierung werden via syslog() geloggt (Ausnahme
sind Fehler in den Kommandozeilenparametern, die auf STDERR ausgegeben
werden). Sobald die Meldung "Euracom vx.x.x listening on /dev/xxx" erscheint"
ist das Programm bereit, eingehende Geb&uuml;hrendaten zu empfangen und zu
verarbeiten.  Wenn Sie so weit gar nicht kommen, hilft vielleicht ein Blick in
die <A HREF="#bugs">Bugs</A>-Section.
</P>
<P>
Um Fehlern besser auf die Spur zu kommen, k&ouml;nnen sie das Programm mit der
Option <CODE>--no-daemon</CODE> starten.  Damit bleibt das Programm im
Vordergrund und gibt alle Ausgaben auf STDERR aus.  Ebenfalls hilfreich ist
die Option <CODE>--debug</CODE> (optional mit Angabe des debugging-Levels),
welche erweiterte Logging-Informationen ausgibt.  Falls Sie erweiterte
Debugging-Ausgaben haben m&ouml;chten, das Programm aber weiterhin als daemon (also
im Background) abgearbeitet werden soll, ist die Angabe eines Logging Files
mit <CODE>--log-file=file</CODE> zwingend erforderlich.
</P>
<P>F&uuml;r weitere Kommandozeilen-Optionen rufen Sie einfach euracom mit dem
Switch <CODE>--help</CODE> auf.  Ansonsten verweise ich hier auf die
mitgelieferte Manual page von 
<A HREF="mailto:volker@illuminatus.mz.rhein-main.de">Volker Schmidt</A>.
</P>
<P>
Am sinnvollsten ist es, wenn Sie das Programm <CODE>euracom</CODE> automatisch
beim Hochfahren des Systems starten.  Ein Beispiel f&uuml;r eine SysV-like
Startup-Prozedur, die dies bewerkstelligt ist z.B.:
</P>
<PRE>
#!/bin/sh

PATH=/usr/local/sbin:/bin:/usr/bin

case "$1" in
    start)
        echo -n "Starting EURACOM accounting..."
        euracom --protocol-file=/var/log/euracom.protocol \
                --log-file=/var/log/euracom.log  \
                --db-host=dbserver \
                --run-as-user=phone /dev/ttyS3
        echo "o.k."
        ;;
    stop)
        echo -n "Shutting down EURACOM accounting: "
        kill -TERM `cat /var/run/euracom.pid`
        echo
        ;;
    *)
        echo "Usage: $0 {start|stop}"
        exit 1
esac
exit 0
</PRE>

<H2>Geb&uuml;hrenauswertung (z.Zt. nur f&uuml;r PostgreSQL)</H2>
<P>
Im Prinzip k&ouml;nnen wir jetzt aufh&ouml;ren.  Etwas Optimismus vorausgesetzt, l&auml;uft
bei Ihnen jetzt ein Programm, da&szlig; die Verbindungsdaten aller ein- und
ausgehenden Gespr&auml;che, die &uuml;ber die Anlage gef&uuml;hrt, mitprotokolliert, via
syslog() ausgibt und dauerhaft in eine Datenbank schreibt.  Mit rudiment&auml;ren
SQL92 Kenntnissen k&ouml;nnen Sie sich z.B. eine Liste der zuletzt gef&uuml;hrten
Gespr&auml;che ausgeben lassen, Monats-, Wochen- oder Tagessummen der
Gespr&auml;chsgeb&uuml;hren berechnen lassen, etc. pp.  Mit dem mitgelieferten
Perl-Skript <CODE>charger.pl</CODE> geht man noch einen kleinen Schritt
weiter.  Man erh&auml;lt einen Einzelverbindungsnachweis f&uuml;r einen, vom Benutzer
festgelegten Zeitraum, in dem Zeitpunkt des Gespr&auml;ches, Zielnummer,
und Geb&uuml;hren, sowie die Summe der Geb&uuml;hren
aufgef&uuml;hrt sind.  Optional wird noch der Ortsnetzname der Nummer, sowie der
Inhaber der Nummer ausgegeben, falls diese Werte in der Datenbank vorhanden
sind.
</P>

<H3>Ben&ouml;tigte Tabellen</H3>
<P>
F&uuml;r die Geb&uuml;hrenauswertung sind 2 weitere Tabellen n&ouml;tig, die sich ebenfalls
in der DB "isdn" befinden m&uuml;ssen.  Beide Tabellen sind bereits durch
<CODE>make database</CODE> erzeugt und mit Beispielwerten gef&uuml;llt worden.
</P>

<P>
Die Tabelle <EM>avon</EM> enth&auml;lt das Verzeichnis der Vorwahlen (Attribut
"nummer" hat die Form "+49vorwahl-ohne-null", also, z.B. "+49228" f&uuml;r Bonn),
die zweite Tabelle <EM>wkn</EM> kann vom Benutzer mit Telefonnummern (in
internationaler Schreibweise (in diesem Fall allerdings ohne irgendwelche
Trennzeichen), also die Felder
</P>

<OL>
<LI>L&auml;ndervorwahl (+49 f&uuml;r Deutschland)
<LI>Vorwahl (ohne 0)
<LI>Teilnehmernummer (oder Anlagen Basisnummer)
<LI>optional: Durchwahl
</OL>

<P>Der Benutzer, der die Geb&uuml;hrenauswertung vornimmt, ben&ouml;tigt 'SELECT' Zugriff
auf alle Tabellen (avon, wkn und euracom)!</P>

<P>
Als Eingabedaten f&uuml;r die "avon"-Tabelle empfehle ich die OKZ-Datei aus dem
<EM>isdnlog</EM> Paket.</P>

<H3>User-defined functions</H3>
<P>
F&uuml;r die Auswertung ist es erforderlich, PostgreSQL um 2 Funktionen zu erweitern,
n&auml;mlich <EM>prefix_match(text,text)</EM> und <EM>length(text)</EM>.  Dazu
m&uuml;ssen Sie folgende PostgreSQL statements absetzen:
</P>

<PRE>
CREATE FUNCTION prefix_match (text, text) 
  RETURNS bool
  AS '/opt/postgreSQL/obj/prefixmatch.so'
  LANGUAGE 'c';

CREATE FUNCTION length (text)
  RETURNS int2
  AS '/opt/postgreSQL/obj/prefixmatch.so'
  LANGUAGE 'c';
</PRE>

<P>
Wenn im Makefile <CODE>PGBASE</CODE> angepa&szlig;t wurde, so m&uuml;ssen Sie nat&uuml;rlich
<CODE>/opt/postgreSQL/obj/prefixmatch.so</CODE> durch den korrekten Pfad von
<CODE>prefixmatch.so</CODE> ersetzen.
</P>

<H3>Aufruf von charger.pl</H3>
<P>
F&uuml;r eine komplette &Uuml;bersicht s&auml;mtlicher unterst&uuml;tzter Kommandozeilen-Parameter
starten Sie <CODE>charger.pl</CODE> mit dem Switch <CODE>-h</CODE>.  Aber Sie
werden das Programm ohnehin noch anpassen m&uuml;ssen, denn ich bezweifele, da&szlig; Sie
in Ihrer Kostenabrechnung gerne meinen Namen in der Fu&szlig;zeile haben m&ouml;chten...
</P>
<P>
Die Zeit/Datumsangaben, die den Optionen <CODE>-v</CODE> und <CODE>-b</CODE>
als Argument mit &uuml;bergeben werden, k&ouml;nnen in jedem Format vorliegen, welches
PostgreSQL unterst&uuml;tzt.
</P>

<H4>Beispielausgabe von "charger.pl"</H4>
<PRE>
bus@goliath [108] =>./charger.pl -v'24.09.1997'
</PRE>
<center><table border="5" cellspacing="2" cellpadding="2">
<tr><th>Anschlu&szlig;</th><th>Datum</th> <th>Rufnummer</th><th>Einheiten</th><th>Betrag</th></tr>
<TR><TD></TD><TD>24.09.1997 03:05</TD><TD>Vergeblicher Anruf von <B>0228 941234-0</B><BR>Mustereintrag; Zentrale <I>(Bonn)</I></TD><TD></TD><TD></TD></TR>
<TR><TD>21</TD><TD>24.09.1997 11:53</TD><TD><B>02364 98765</B><BR>Testuser, Werner <I>(Haltern Westf)</I></TD><TD>13</TD><TD>1.56 DEM
</TD></TR>
<TR><TD>11</TD><TD>26.09.1997 08:59</TD><TD><B>0228 941234-361</B><BR>Mustereintrag; Durchwahl 2 <I>(Bonn)</I></TD><TD>6</TD><TD>0.72 DEM
</TD></TR>
<TR><TD>42</TD><TD>26.09.1997 09:04</TD><TD>Eingehender Anruf</TD><TD></TD><TD></TD></TR>
<TR><TD>11</TD><TD>26.09.1997 09:09</TD><TD>Eingehender Anruf von <B>0228 941234-361</B><BR>Mustereintrag; Durchwahl 2 <I>(Bonn)</I></TD><TD></TD><TD></TD></TR>
<tr><td></td><td></td><td>2 Gespr&auml;che</td><td>19</td><td>2.28 DEM</td></tr>
<tr><td></td><td></td><td>Grundgeb&uuml;hr</td><td></td><td>18.00 DEM</td></tr>
<tr><td></td><td></td><td>GESAMT:</td><td></td><td><B>20.28 DEM</B></td></tr>
</table></center><br><hr><address>Michael Bussmann, Im Brook 8, 45721 Haltern</address>

<H3>Weitere Utilities</H3>
<H4>"do_charger.sh"</H4>
<P>
<CODE>do_charger</CODE> ist das Programm, das bei mir jeden 1. des Monats per
cron aufgerufen wird, um die monatliche Geb&uuml;hrenauswertung/Telefonrechnung
zu erstellen.  Starten Sie es bitte <B>nicht</B>, ohne entsprechende
Anpassungen an Ihre lokale Situation vorzunehmen!
</P>

<H4>avon.pl</H4>
<P>
Dieses kleine Progr&auml;mmchen dient dazu, eine Telefonnummer (in internationaler
Schreibweise (wieder ohne Trennzeichen)) in einen formatierten String
umzuwandeln, der die Nummer in Ortsnetz, Basisnummer + Durchwahl unterteilt und
Ortsnetzname und Anschlu&szlig;inhaber auflistet.  Dies setzt nat&uuml;rlich voraus, da&szlig;
die Tabellen avon und wkn entsprechend gef&uuml;llt sind.
</P>
<P>Auch hier erhalten Sie eine komplette &Uuml;bersicht der
Kommandozeilen-Parameter durch Angabe der Option <CODE>-h</CODE>.
</P>
<P>Nach dem Start erwartet das Programm auf STDIN eine Telefonnummer und gibt
dann auf STDOUT den aufgearbeiteten String aus.  Die Eingabe EOF (^D) beendet
das Programm.
</P>

<H3>Spa&szlig; mit SQL</H3>
<P>
Auch wenn man mit <CODE>charger.pl</CODE> eine mehr oder minder sch&ouml;n
aufgearbeitete Verbindungsliste in HTML bekommt, ist es doch zuweilen
einfacher und schneller ein paar SQL-Statements direkt abzusetzen, z.B. wenn
man mal eben so auf die Schnelle eine &Uuml;bersicht der bis dato angelaufenen
Kosten braucht.  Hier also mal ein paar (na gut, im Moment nur ein) Beispiele
f&uuml;r solche Statements:
</P>
<DL>
<DT>Monatsgesamtsummen (f&uuml;r Januar 1998) pro Teilnehmer:
<DD>SELECT int_no,sum(einheiten) AS einheiten_summe,sum(pay) AS
gesamt_summe,count(*) AS anzahl<BR>
  FROM euracom<BR>
  WHERE sys_date BETWEEN '1998-01-01 00:00:00' AND '1998-01-31 23:59:59'<BR>
  AND int_no!=0<BR>
  AND pay>0<BR>
  GROUP BY int_no;
</DL>

<A NAME="bugs"></A>
<H2>Bekannte Bugs</H2>
<P>
Nat&uuml;rlich <EM>bekannte</EM> Bugs; wenn hier <EM>unbekannte</EM> Bugs st&auml;nden,
w&auml;ren Sie wohl bald gefixt.  Nein, dann w&auml;ren es keine unbekannten Bugs
mehr...<BR>
Wie auch immer, bevor ich mich hier verrenne: Mir liegen zur Zeit folgende
Bugreports vor:
</P>
<UL>
<LI>
  <DL><DT>Euracom meldet beim Hochfahren: <CODE>Euracom did not raise CTS. Check
	  connection</CODE>
      <DD>Dies deutet in den meisten F&auml;llen auf einen Fehler im
	  Verbindungskabel
	  hin. <B>ABER:</B> bei gewissen V24-Karten (die <EM>Cyclades</EM> ist so
	  ein Fall) scheint das Programm Schwierigkeiten zu haben CTS zu erkennen.
	  Falls das Verbindungskabel als Fehlerursache ausscheidet, &uuml;bersetzen
	  Sie das Programm mit <CODE>./configure --disable-cts-check</CODE>.
  </DL>

<LI>
  <DL><DT>Euracom meldet beim Programmende: <CODE>Euracom did not unset CTS</CODE>
      <DD>Ignorieren.  Einfach ignorieren :-) Falls es zusehr st&ouml;rt, einfach
          mit <CODE>./configure --disable-cts-check</CODE> &uuml;bersetzen.
  </DL>

<LI><DL><DT>Bei der Geb&uuml;hrenauswertung mittels <CODE>charger.pl</CODE>
            verbraucht der <CODE>postgres</CODE>-Proze&szlig; sehr viel
            Speicherplatz.
        <DD>Compilieren Sie PostgreSQL mit der Pre-Processor Option
            <CODE>-DTBL_FREE_CMD_MEMORY</CODE>. (Ab PostgreSQL 6.3 ist dies
            die Defaulteinstellung.)
    </DL>
</UL>

<P>
Wenn Sie irgendwelche Bugs, Verbesserungsvorschl&auml;ge, Kritik haben (oder mir
einfach nur sagen wollen, da&szlig; Sie das Programm benutzen), z&ouml;gern Sie nicht und
schreiben mir.  Die Adresse finden Sie im Abschnitt
<A HREF="#contact">Kontaktadresse</A>.  Falls Sie Bugs entdecken, ist es
sinnvoll, mir ebenfalls die Logs zukommen zu lassen.  Starten Sie dazu das
Programm mit <CODE>--debug</CODE> (und evtl. <CODE>--log-file=file</CODE> bzw.
<CODE>--no-daemon</CODE>).  Bei coredumps bitte ich von der Zusendung des core
files abzusehen :-), daf&uuml;r k&ouml;nnte sich der Stack-Trace als zweckm&auml;&szlig;iger
erweisen.
</P>

<A NAME="#contact"></A>
<H2>Kontaktadresse</H2>
<P>
Falls Probleme bei der Installation oder w&auml;hrend des Betriebes auftreten,
so werde ich gerne versuchen zu helfen.  Ebenso w&uuml;rde es mich nat&uuml;rlich
interessieren, bei wem die Software tats&auml;chlich im Einsatz ist.  Also,
Bugreports, Lob, Tadel, Kommentare, etc. nach <A HREF="mailto:bus@fgan.de">
bus@fgan.de</A>.  Weitere Kontaktm&ouml;glichkeiten finden Sie
<A HREF="http://www.fgan.de/~bus/contact.html">hier</A>.
</P>
<BR>
<HR>
<BR>

<ADDRESS> ruf098 WWW, <A HREF="http://www.fgan.de/~bus/">Michael Bussmann</A>,
<A HREF="mailto:bus@fgan.de">&lt;bus@fgan.de&gt;</A> ,
Last change: $Date: 1999/06/03 12:44:18 $, $Revision: 1.15 $
</ADDRESS>

</BODY>
</HTML>
